---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyleOverrideOptions.#ctor(Autodesk.Revit.DB.TableCellStyleOverrideOptions)
source: html/e6a72fc7-05b7-7ea1-e27e-631a38ab6e25.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.#ctor Method

Creates a new instance by copying an existing instance.

## Syntax (C#)
```csharp
public TableCellStyleOverrideOptions(
	TableCellStyleOverrideOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.TableCellStyleOverrideOptions`) - The instance to copy

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null